Revit 2027 API
AreaVolumeSettings.GetAreaVolumeSettings Method
 Get the area and volume settings of the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AreaVolumeSettings GetAreaVolumeSettings(
	Document aDoc
)
Public Shared Function GetAreaVolumeSettings (
	aDoc As Document
) As AreaVolumeSettings
public:
static AreaVolumeSettings^ GetAreaVolumeSettings(
	Document^ aDoc
)
static member GetAreaVolumeSettings :
        aDoc : Document -> AreaVolumeSettings
Parameters
aDoc Document
 The document.
Return Value
AreaVolumeSettings
 The area and volume settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace